const replacements = [
  { word: '也', replacement: '喵' },
  { word: '哉', replacement: '喵' },
  { word: '耶', replacement: '喵' },
  { word: '乎', replacement: '喵' },
  { word: '焉', replacement: '喵' },
  { word: '矣', replacement: '喵' },
  { word: '呜呼', replacement: '喵喵' },
]

const random_inputs = [
  `吾尝终日而思矣，不如须臾之所学也；\n吾尝跂而望矣，不如登高之博见也。\n登高而招，臂非加长也，而见者远；\n顺风而呼，声非加疾也，而闻者彰。\n假舆马者，非利足也，而致千里；\n假舟楫者，非能水也，而绝江河。\n君子生非异也，善假于物也。`,
  `噫吁嚱，危乎高哉！\n蜀道之难，难于上青天！\n蚕丛及鱼凫，开国何茫然！\n尔来四万八千岁，不与秦塞通人烟。\n西当太白有鸟道，可以横绝峨眉巅。\n地崩山摧壮士死，然后天梯石栈相钩连。\n上有六龙回日之高标，下有冲波逆折之回川。\n黄鹤之飞尚不得过，猿猱欲度愁攀援。\n青泥何盘盘，百步九折萦岩峦。\n扪参历井仰胁息，以手抚膺坐长叹。\n问君西游何时还？畏途巉岩不可攀。\n但见悲鸟号古木，雄飞雌从绕林间。\n又闻子规啼夜月，愁空山。\n蜀道之难，难于上青天，使人听此凋朱颜！\n连峰去天不盈尺，枯松倒挂倚绝壁。\n飞湍瀑流争喧豗，砯崖转石万壑雷。\n其险也如此，嗟尔远道之人胡为乎来哉！\n剑阁峥嵘而崔嵬，一夫当关，万夫莫开。\n所守或匪亲，化为狼与豺。\n朝避猛虎，夕避长蛇，磨牙吮血，杀人如麻。\n锦城虽云乐，不如早还家。\n蜀道之难，难于上青天，侧身西望长咨嗟！`,
  `夫君子之行，静以修身，俭以养德。\n非淡泊无以明志，非宁静无以致远。\n夫学须静也，才须学也，\n非学无以广才，非志无以成学。\n淫慢则不能励精，险躁则不能治性。\n年与时驰，意与日去，\n遂成枯落，多不接世，\n悲守穷庐，将复何及！`,
  `北冥有鱼，其名为鲲。\n鲲之大，不知其几千里也。\n化而为鸟，其名为鹏，\n鹏之背，不知其几千里也；\n怒而飞，其翼若垂天之云。`,
  `虽有嘉肴，弗食，不知其旨也。\n虽有至道，弗学，不知其善也。\n是故学然后知不足，教然后知困。\n知不足，然后能自反也；\n知困，然后能自强也。\n故曰：教学相长也。\n《兑命》曰：学学半。其此之谓乎？`,
  `环滁皆山也。\n其西南诸峰，林壑尤美，望之蔚然而深秀者，琅琊也。\n山行六七里，渐闻水声潺潺而泻出于两峰之间者，酿泉也。`,
  `八月秋高风怒号，卷我屋上三重茅。\n茅飞渡江洒江郊，高者挂罥长林梢，下者飘转沉塘坳。\n南村群童欺我老无力，忍能对面为盗贼。\n公然抱茅入竹去，唇焦口燥呼不得，归来倚杖自叹息。\n俄顷风定云墨色，秋天漠漠向昏黑。\n布衾多年冷似铁，娇儿恶卧踏里裂。\n床头屋漏无干处，雨脚如麻未断绝。\n自经丧乱少睡眠，长夜沾湿何由彻！\n安得广厦千万间，大庇天下寒士俱欢颜！\n风雨不动安如山。\n呜呼！何时眼前突兀见此屋，吾庐独破受冻死亦足！`,
  `鱼，我所欲也；熊掌，亦我所欲也；\n二者不可得兼，舍鱼而取熊掌者也。\n生，亦我所欲也；义，亦我所欲也。\n二者不可得兼，舍生而取义者也。`,
  `夫战，勇气也。\n一鼓作气，再而衰，三而竭。\n彼竭我盈。故克之。\n夫大国难测也，惧有伏焉。\n吾视其辙乱，望其旗靡，故逐之。`,
  `积土成山，风雨兴焉；积水成渊，蛟龙生焉；\n积善成德，而神明自得，圣心备焉。\n故不积跬步，无以至千里；\n不积小流， 无以成江海。\n骐骥一跃，不能十步；驽马十驾，功在不舍。\n锲而舍之，朽木不折；锲而不舍，金石可镂。\n蚓无爪牙之利，筋骨之强，\n上食埃土，下饮黄泉，用心一也。\n蟹六跪而二螯，非蛇鳝之穴无可寄托者，用心躁也。`,
  `嗟乎！师道之不传也久矣！欲人之无惑也难矣！\n古之圣人，其出人也远矣，犹且从师而问焉；\n今之众人，其下圣人也亦远矣，而耻学于师。\n是故圣益圣，愚益愚。\n圣人之所以为圣，愚人之所以为愚，其皆出于此乎？`,
  `呜呼！灭六国者，六国也，非秦也。\n族秦者，秦也，非天下也。\n嗟乎！使六国各爱其人，则足以拒秦；\n使秦复爱六国之人，则递三世可至万世而为君，谁得而族灭也？\n秦人不暇自哀，而后人哀之；\n后人哀之而不鉴之，亦使后人而复哀后人也。`,
]

export const convert_text = (text: string) => {
  let converted_html = text
  replacements.forEach(({ word, replacement }) => {
    converted_html = converted_html.replace(
      new RegExp(word, 'g'),
      `<strong>${replacement}</strong>`,
    )
  })
  return converted_html
}

function get_random_element<T>(array: T[]): T {
  return array[Math.floor(Math.random() * array.length)]
}

export const get_random_input = () => {
  return get_random_element(random_inputs)
}
